[Killed] BlockStatement
src/Roller.ts:20:32
     //       this._faces = faces;
     //     }
     //   }
-    constructor(faces: number) {
-        if (faces < 2) {
-            this._faces = 6;
-        } else {
-            this._faces = faces;
-        }
-        this._distribution = new Map();
-    }
+    constructor(faces: number) {}
     
 
killedBy: Die Can be instantiated with default number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/Roller.ts:44:33
     //     return value;
     // }
 
-    roll(value: number): number {
-        if (!Number.isInteger(value) || value < 1 || value > this._faces) {
-            return 0;
-
-        }
-        this._last = value;
-        const rollCount = this._distribution.get(value) ?? 0;
-        this._distribution.set(value, rollCount + 1);
-        return value;
-    }
+    roll(value: number): number {}
       
 
killedBy: Die Roll returns a valid value and updates the last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:45:54
     // }
 
     roll(value: number): number {
-        if (!Number.isInteger(value) || value < 1 || value > this._faces) {
+        if (!Number.isInteger(value) || value < 1 || false) {
             return 0;
 
killedBy: Die Roll returns 0 and does not update the last roll or distribution if value is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 7

[Killed] BlockStatement
src/Roller.ts:45:75
     // }
 
     roll(value: number): number {
-        if (!Number.isInteger(value) || value < 1 || value > this._faces) {
-            return 0;
-
-        }
+        if (!Number.isInteger(value) || value < 1 || value > this._faces) {}
         this._last = value;
         const rollCount = this._distribution.get(value) ?? 0;
killedBy: Die Roll returns 0 and does not update the last roll or distribution if value is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 7

[Killed] LogicalOperator
src/Roller.ts:50:27
 
         }
         this._last = value;
-        const rollCount = this._distribution.get(value) ?? 0;
+        const rollCount = this._distribution.get(value) && 0;
         this._distribution.set(value, rollCount + 1);
         return value;
killedBy: Die Roll returns a valid value and updates the last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] ArithmeticOperator
src/Roller.ts:51:39
         }
         this._last = value;
         const rollCount = this._distribution.get(value) ?? 0;
-        this._distribution.set(value, rollCount + 1);
+        this._distribution.set(value, rollCount - 1);
         return value;
     }
killedBy: Die Roll returns a valid value and updates the last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/Roller.ts:62:20
     //     return this._last;
     // }
 
-    last(): number {
-        if (this._last === null) {
-          return 0;
-        }
-        return this._last;
-      }
+    last(): number {}
       
 
killedBy: Die Roll returns a valid value and updates the last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:63:13
     // }
 
     last(): number {
-        if (this._last === null) {
+        if (true) {
           return 0;
         }
killedBy: Die Roll returns a valid value and updates the last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] EqualityOperator
src/Roller.ts:63:13
     // }
 
     last(): number {
-        if (this._last === null) {
+        if (this._last !== null) {
           return 0;
         }
killedBy: Die Roll returns a valid value and updates the last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/Roller.ts:77:40
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number>{
-        // ret =  new Map<number, number>();
-        return this._distribution;
-
-    }
+    distribution(): Map<number, number>{}
 
 
killedBy: Die Roll returns a valid value and updates the last roll and distribution
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/Roller.ts:88:25
     //     return this._faces;
     //   }
 
-    get faces(): number {
-        return this._faces;
-    }
+    get faces(): number {}
 
 
killedBy: Die Can be instantiated with default number of faces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined
